/**
 * Created with IntelliJ IDEA.
 * User: Test
 * Date: 11.02.13
 * Time: 1:29
 * To change this template use File | Settings | File Templates.
 */

ymaps.ready(init);
var myMap, myCircle1;
var array = [];

function init(){
    myMap = new ymaps.Map ("map", {
        center: [50.502232, 30.497643],
        zoom: 14
    });

    var metroStations =[
        // синяя линия метро
        [50.522910, 30.498885],	// Героев Днепра 1
        [50.522390, 30.498842],	// Героев Днепра 2
        [50.511594, 30.497866],	// Минская 1
        [50.511519, 30.499271],	// Минская 2
        [50.512860, 30.499341],	// Минская 3
        [50.512908, 30.497890],	// Минская 4
        [50.502232, 30.497643],	// Оболонь 1
        [50.502205, 30.498903],	// Оболонь 2
        [50.500736, 30.498979],	// Оболонь 3
        [50.487033, 30.498331],	// Петровка 1
        [50.473561, 30.504825],	// Тараса Шевченко 1
        [50.466454, 30.513858],	// Контрактова 1
        [50.465133, 30.516253],	// Контрактова 2
        [50.458948, 30.525059],	// Почтовая 1
        [50.449794, 30.524388],	// Майдан 1
        [50.439612, 30.516979],	// Льва Толстого 1
        [50.432191, 30.516497],	// Олимпийская 1
        [50.420631, 30.520901],	// Дворец Украины 1
        [50.412501, 30.523804],	// Лыбедская 1
        [50.413207, 30.525501],	// Лыбедская 2
        [50.404667, 30.516362],	// Демеевская 1
        [50.40453, 30.517435],	// Демеевская 2
        [50.405531, 30.5169],	// Демеевская 3
        [50.405223, 30.517941],	// Демеевская 4
        [50.397639, 30.508373],	// Голосеевская 1
        [50.397303, 30.509393],	// Голосеевская 2
        [50.397947, 30.509566],	// Голосеевская 3
        [50.393131, 30.487538],	// Васильковская 1
        [50.393446, 30.489514],	// Васильковская 2
        [50.381528, 30.476984],	// Выставочный центр 1
        [50.376079, 30.467484],	// Ипподром 1
        // зеленая линия метро
        [50.47645, 30.43084],	// Сырец 1
        [50.47365, 30.448768],	// Дорогожичи 1
        [50.462334, 30.481945],	// Лукьяновская 1
        [50.44838, 30.513818],	// Золотые ворота 1
        [50.43794, 30.520937],	// Дворец спорта 1
        [50.436938, 30.531877],	// Кловская 1
        [50.427274, 30.538642],	// Печерская 1
        [50.427905, 30.539665],	// Печерская 2
        [50.41845, 30.544553],	// Дружбы народов 1
        [50.417858, 30.544982],	// Дружбы народов 2
        [50.401319, 30.561585],	// Выдубичи 1
        [50.394167, 30.604371],	// Славутич 1
        [50.395671, 30.616939],	// Осокорки 1
        [50.395397, 30.61527],	// Осокорки 2
        [50.397911, 30.633365],	// Позняки 1
        [50.398131, 30.635605],	// Позняки 2
        [50.400658, 30.651319],	// Харьковская 1
        [50.40096, 30.653103],	// Харьковская 2
        [50.403088, 30.666021],	// Вырлица 1
        [50.403264, 30.683028],	// Бориспольская 1
        [50.409798, 30.696902],	// Красный хутор 1
        // красная линия метро
        [50.465604, 30.354867],	// Академгородок 1
        [50.464152, 30.354952],	// Академгородок 2
        [50.465604, 30.355884],	// Академгородок 3
        [50.464235, 30.356013],	// Академгородок 4
        [50.455923, 30.364645],	// Житомирская 1
        [50.457704, 30.391835],	// Святошин 1
        [50.457704, 30.38838],	// Святошин 2
        [50.459391, 30.405875],	// Нивки 1
        [50.458459, 30.403128],	// Нивки 2
        [50.458569, 30.421217],	// Берестейская 1
        [50.454897, 30.44533],	// Шулявская 1
        [50.450684, 30.466195],	// Политехнический институт 1
        [50.441669, 30.487897],	// Вокзальная 1
        [50.444309, 30.505864],	// Университет 1
        [50.445233, 30.517818],	// Театральная 1
        [50.447567, 30.528786],	// Хрещатик 1
        [50.447156, 30.522651],	// Хрещатик 2
        [50.444252, 30.545337],	// Арсенальная 1
        [50.440963, 30.558769],	// Днепр 1
        [50.446089, 30.576856],	// Гидропарк 1
        [50.451427, 30.597474],	// Левобережная 1
        [50.451838, 30.599194],	// Левобережная 2
        [50.45562, 30.613085],	// Дарница 1
        [50.456634, 30.613986],	// Дарница 2
        [50.459808, 30.630326],	// Чениговская 1
        [50.464896, 30.643714],	// Лесная 1
        [50.464184, 30.644403],	// Лесная 2
        [50.465444, 30.645926],	// Лесная 3

    ];
    //   [цифра, цифра],	// Петровка 1
    for (var i = 0; i < metroStations.length; i++) {
        array[i] = new ymaps.Circle([metroStations[i], 750], {}, {
            fillColor: "#6666CC", fillOpacity: 0.1, strokeOpacity: 0.5, strokeWidth: 0.5
        });
    }

    for (var i = 0; i < array.length; i++) {
        myMap.geoObjects.add(array[i]);
    }

    myMap.controls.add(new ymaps.control.ZoomControl());
    myMap.controls.add(new ymaps.control.ScaleLine());
    myMap.controls.add(new ymaps.control.MapTools());

}